# Домашняя работа по 25 заданиям (20.09.2023)

1. Назовём нетривиальным делителем натурального числа его делитель, не равный единице и самому числу. Например, у числа 6 есть два нетривиальных делителя: 2 и 3. Найдите все натуральные числа, принадлежащие отрезку [289123456; 389123456] и имеющие ровно три нетривиальных делителя. Для каждого найденного числа запишите в ответе его наибольший нетривиальный делитель. Ответы расположите в порядке возрастания.  
Например, в диапазоне [5; 16] ровно три различных натуральных делителя имеет число 16, поэтому для этого диапазона вывод на экране должна содержать следующие значения: 16 8.  
Ответ: `294499921 2248091`, `352275361 2571353`, `373301041 2685619`
```python
def delit(n):
    kolD = set()
    for d in range(2, int(n ** 0.5) + 1):
        if n % d == 0:
            kolD.add(d)
            kolD.add(n//d)
    return kolD


for x in range(289123456, 389123457):
    if x ** 0.5 == int(x ** 0.5):
        d = delit(x)
        if len(d) == 3:
            print(x, max(d))
```
2. Пусть M  — сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа. Если таких делителей у числа нет, то считаем значение M равным нулю.  
Напишите программу, которая перебирает целые числа, большие 452 021, в порядке возрастания и ищет среди них такие, для которых значение M при делении на 7 даёт в остатке 3. Вывести первые 5 найденных чисел и соответствующие им значения M.  
Формат вывода: для каждого из 5 таких найденных чисел в отдельной строке сначала выводится само число, затем  — значение М. Строки выводятся в порядке возрастания найденных чисел.  
Например, для числа 20 М  =  2 + 10  =  12, остаток при делении на 7 не равен 3; для числа 21 М  =  3 + 7  =  10, остаток при делении на 7 равен 3.  
Количество строк в таблице для ответа избыточно.  
Ответ: `452025 150678`, `452029 23810`, `452034 226019`, `452048 226026`, `452062 226033`
```python
def deliteli(n):
    kolD = set()
    for d in range(2, int(n ** 0.5) + 1):
        if n % d == 0:
            kolD.add(d)
            kolD.add(n//d)
    if len(kolD) < 2: return 0
    return min(kolD) + max(kolD)


cnt = 0
for x in range(452022, 1000000000):
    if cnt == 5: break
    M = deliteli(x)
    if M % 7 == 3:
        cnt += 1
        print(x, M)
```
3. Найдите 5 чисел больших 500000, таких, что среди их делителей есть число, оканчивающееся на 8, при этом этот делитель не равен 8 и самому числу. В качестве ответа приведите 5 наименьших чисел, соответствующих условию.  
Формат вывода: для каждого из 5 таких найденных чисел в отдельной строке сначала выводится само число, затем минимальный делитель, оканчивающийся на 8, не равный 8 и самому числу.  
Ответ: `500002 178`, `500004 18`, `500016 48`, `500018 58`, `500020 4348`
```python
def vociem(n):
    flag = set()
    for d in range(2, int(n ** 0.5) + 1):
        if n % d == 0:
            if d != 8 and d % 10 == 8:
                flag.add(d)
            if (n // d) != 8 and (n // d) % 10 == 8:
                flag.add(n // d)
    return flag


cnt = 0
for x in range(500001, 1000000000):
    if cnt == 5: break
    d = vociem(x)
    if len(d) != 0:
        cnt += 1
        print(x, min(d))
```
4. Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [489 421; 489 440], числа, имеющие ровно четыре различных натуральных делителя. Для каждого найденного числа запишите эти четыре делителя в четыре соседних столбца на экране с новой строки. Делители в строке должны следовать в порядке возрастания.  
Например, в диапазоне [12; 14] ровно четыре различных натуральных делителя имеет число 14, поэтому для этого диапазона вывод на экране должна содержать следующие значения: 1 2 7 14.  
Ответ: `1 19 25759 489421`, `1 2 244711 489422`, `1 13 37649 489437`
```python
def delitel(n):
    kolD = {1, n}
    for d in range(2, int(n ** 0.5) + 1):
        if n % d == 0:
            kolD.add(d)
            kolD.add(n // d)
    return sorted(kolD)


for x in range(489421, 489441):
    d = delitel(x)
    if len(d) == 4:
        print(*d)
```
