# Домашняя работа по 25 заданиям (20.09.2023)

1. Назовём нетривиальным делителем натурального числа его делитель, не равный единице и самому числу. Например, у числа 6 есть два нетривиальных делителя: 2 и 3. Найдите все натуральные числа, принадлежащие отрезку [289123456; 389123456] и имеющие ровно три нетривиальных делителя. Для каждого найденного числа запишите в ответе его наибольший нетривиальный делитель. Ответы расположите в порядке возрастания.  
Например, в диапазоне [5; 16] ровно три различных натуральных делителя имеет число 16, поэтому для этого диапазона вывод на экране должна содержать следующие значения: 16 8.  
Ответ: `294499921 2248091`, `352275361 2571353`, `373301041 2685619`
```python
def delit(n):
    kolD = set()
    for d in range(2, int(n ** 0.5) + 1):
        if n % d == 0:
            kolD.add(d)
            kolD.add(n//d)
    return kolD


for x in range(289123456, 389123457):
    if x ** 0.5 == int(x ** 0.5):
        d = delit(x)
        if len(d) == 3:
            print(x, max(d))
```
