# Домашняя работа по 25 заданиям (20.09.2023)

1. (№ 6284) Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:  
— символ «?» означает ровно одну произвольную цифру;  
— символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.  
Среди натуральных чисел, не превышающих 1010, найдите все числа, соответствующие маске 2?5432*1, делящиеся на 1017 без остатка и содержащие хотя бы одну цифру 9. В ответе запишите все найденные числа в порядке возрастания, справа от каждого числа – результат его деления на 1017.  
Ответ: `2254325931 2216643`, `2454329151 2413303`, `2554320591 2511623`, `2954327031 2904943`
```python
from fnmatch import *
for x in range(1017, 10 ** 10 + 1, 1017):
    sx = str(x)
    if fnmatch(sx, '2?5432*1') and '9' in sx:
        print(x, x // 1017)
```
2.(№ 6188) (Р. Сорокин) Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:  
— символ «?» означает ровно одну произвольную цифру;  
— символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.  
Найдите все натуральные числа, не превышающие 106, кратные 3131, которые имеют ровно три делителя, соответствующих маске 2*5*. Количество делителей, не соответствующих данной маске, может быть любым. В ответе запишите все найденные числа в порядке возрастания, а справа от каждого число – его наибольший делитель, соответствующий маске 2*5*.  
Ответ: `475912 237956`, `576104 288052`, `626200 25048`, `760833 253611`, `779619 259873`, `801536 25856`, `951824 237956`
```python
from fnmatch import *
for x in range(3131, 10 ** 6 + 1, 3131):
    kd = 0
    mad = 0
    for d in range(2, x + 1):
        if x % d == 0 and fnmatch(str(d), '2*5*'):
            kd += 1
            mad = d
    if kd == 3:
        print(x, mad)
```
3. (№ 6068) В файле(https://kpolyakov.spb.ru/cms/files/ege-seq/17-354.txt) содержится последовательность целых чисел, по модулю не превышающих 10000. Определите количество пар, для которых выполняются следующие условия:  
– запись элементов пары заканчивается одной и той же цифрой;  
– только один из элементов пары делится без остатка на 3;  
– сумма квадратов элементов пары не превышает квадрат наименьшего из всех элементов последовательности, запись которых заканчивается цифрой 1.  
В ответе запишите два числа: сначала количество найденных пар, затем максимальную сумму элементов этих пар.  
Ответ: 157 13138
```python
n = [int(x) for x in open('1.txt')]

mi = 1000000000000
for x in n:
    if abs(x) % 10 == 1:
        mi = min(mi, x)

kp = 0
mas = -1000000000000
for i in range(len(n) - 1):
    if abs(n[i]) % 10 == abs(n[i + 1]) % 10:
        if (n[i] % 3 == 0 and n[i + 1] % 3 != 0) or (n[i] % 3 != 0 and n[i + 1] % 3 == 0):
            if n[i] ** 2 + n[i + 1] ** 2 <= mi ** 2:
                kp += 1
                mas = max(mas, n[i] + n[i + 1])
print(kp, mas)
```


for x in range(489421, 489441):
    d = delitel(x)
    if len(d) == 4:
        print(*d)
```
